Revit 2027 API
ScheduleHeadingOrientation Enumeration
 Orientation of schedule heading.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleHeadingOrientation
Public Enumeration ScheduleHeadingOrientation
public enum class ScheduleHeadingOrientation
type ScheduleHeadingOrientation
Members
Member name | Value | Description
Horizontal | 0 |  Horizontal
Vertical | 1 |  Vertical
See Also
Reference
Autodesk.Revit.DB Namespace